muebleria/app/Controllers/ClienteC.php

UPDATE `Cliente` SET `telefonoCliente` = '2121212212', `updated_at` = '2024-09-25 04:16:58'
WHERE `idcliente` = '4'
---
    public function update(){
        $clienteM = model('ClienteM');
        $idcliente = $_POST['idCliente'];

               $data = [
                   'nombreCliente' => $_POST['nombreCliente'],

               ];
               $data = [
                'apellidoCliente' => $_POST['apellidoCliente'],

            ];
            $data = [
                'codigoPostal' => $_POST['codigoPostal'],

            ];
            $data = [
                'fechaRegistro' => $_POST['fechaRegistro'],

            ];
            $data = [
                'telefonoCliente' => $_POST['telefonoCliente'],

            ];

               $clienteM->set($data)->where('idcliente',$idcliente)->update();

SELECT *
FROM `Cliente`
WHERE `idCliente` = '4'
---
    public function Edit($idCliente){   //get
        $idCliente = $data['idCliente'] = $idCliente;
        $clienteM = model('ClienteM');
        $data['cliente'] = $clienteM->where('idCliente',$idCliente)->findAll();