app/Controllers/Categoria.php

SELECT *
FROM `Mueble`
WHERE `idMueble` = '3'
---
    public function Producto($idMueble)
    {

        $mueblesM = model('MueblesM');

        $productos['producto'] = $mueblesM->where('idMueble', $idMueble)->findAll();