app/Controllers/UsuarioC.php

        }
        else{
            $usuarioM = model('UsuarioM');
            $usuarioM->insert($data);
---
INSERT INTO `Usuario` (`nombreUsuario`, `apellidoPaterno`, `apellidoMaterno`, `telefono`, `correo`, `rol`, `pass`, `created_at`, `updated_at`) VALUES ('Cris', 'Trujillo', 'Carranco', '762763276', 'Bodrox@sus.com', '2', 'sussus', '2024-11-28 04:29:34', '2024-11-28 04:29:34')